# TW1

## Pandas Series and DataFrame

- Practice Pandas Series and DataFrame with examples.

## Name: Rizvan Ahmed Rafsan

## Part 0

Practice Pandas Series and DataFrame with the given examples.

In [1]:
import pandas as pd

In [2]:
alist = ['Mouse', 'Giraffe', 'Tiger', 'Dog', 'Hippopotamus', 'Moose', 'Bear']
animals = pd.Series(alist)
animals

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [3]:
animals[2]

'Tiger'

In [4]:
animals.iloc[2]

'Tiger'

In [5]:
animals.loc[2]

'Tiger'

In [6]:
s1 = pd.Series(alist, index=[0, 1, 2, 3, 4, 5, 6])
s1.iloc[2]

'Tiger'

In [7]:
s1.loc[2]

'Tiger'

In [8]:
s2 = pd.Series(alist, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
s2

a           Mouse
b         Giraffe
c           Tiger
d             Dog
e    Hippopotamus
f           Moose
g            Bear
dtype: object

In [9]:
s2['c']

'Tiger'

In [10]:
s2.iloc[2]

'Tiger'

In [11]:
names = ['Chris', 'Kevin', 'Bob', 'Vinod', 'Daniel', 'Fil', 'Stephanie']
owners = pd.Series(names)
owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
dtype: object

In [12]:
frame = {'animals': animals, 'owners': owners}

df = pd.DataFrame(frame)

df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [13]:
df.columns

Index(['animals', 'owners'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [15]:
type(df['animals'])

pandas.core.series.Series

In [16]:
df.iloc[0]

animals    Mouse
owners     Chris
Name: 0, dtype: object

In [17]:
df.loc[0][1]

/var/folders/x2/3118c13j6_114k46f2zqb35c0000gp/T/ipykernel_9692/395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

'Chris'

In [18]:
df.owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
Name: owners, dtype: object

In [19]:
df['owners']

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
Name: owners, dtype: object

In [20]:
# copy an existing DataFrame to create a new dataFrame
copy_df = df.copy()
copy_df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [21]:
# drop columns

df2 = df.drop(['owners'], axis = 1)

df2

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [22]:
# drop columns

df3 = df.drop(columns = ['owners'])

df3

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [23]:
# drop rows

df4 = df.drop([0,1])
df4

        animals     owners
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [24]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
                             ['speed', 'weight']],
                     codes=[[0, 0, 1, 1, 2, 2],
                            [0, 1, 0, 1, 0, 1]])

midx

MultiIndex([(  'lama',  'speed'),
            (  'lama', 'weight'),
            (   'cow',  'speed'),
            (   'cow', 'weight'),
            ('falcon',  'speed'),
            ('falcon', 'weight')],
           )

In [25]:
df = pd.DataFrame(index=midx, columns=['big', 'small'],
                   data=[[45, 30], [200, 100], [30, 20], [250, 150], [320, 250],[1, 0.8]])

df

               big  small
lama   speed    45   30.0
       weight  200  100.0
cow    speed    30   20.0
       weight  250  150.0
falcon speed   320  250.0
       weight    1    0.8

In [26]:
df.drop(index='cow', columns='small')

               big
lama   speed    45
       weight  200
falcon speed   320
       weight    1

In [27]:
df.drop(index='weight', level=1)

              big  small
lama   speed   45   30.0
cow    speed   30   20.0
falcon speed  320  250.0

## Part 1 Task 1

Given the data below, implement each tasks.

<img src="img/df.png" style="height:200px">

(1) Create a DataFrame.

(2) Access the first row data and print it.

(3) Access the first column data (indexed by 'dept') and print it.

(4) Create a new DataFrame by dropping the 2nd column data (indexed by 'floor') from the current DataFrame.

### 1. Create a DataFrame.

In [28]:
# Create a DataFrame using lists and Series
dept_list = ['CS', 'Bio', 'Chem', 'Phy', 'Eng']
floor_list = [5, 3, 3, 2, 4]

dept = pd.Series(dept_list)
floor = pd.Series(floor_list)

frame = {'dept': dept, 'floor': floor}
df = pd.DataFrame(frame)
df

   dept  floor
0    CS      5
1   Bio      3
2  Chem      3
3   Phy      2
4   Eng      4

### 2. Access the first row data and print it.

In [29]:
print(df.iloc[0])

dept     CS
floor     5
Name: 0, dtype: object

### 3. Access the first column data (indexed by 'dept') and print it.

In [30]:
print(df['dept'])

0      CS
1     Bio
2    Chem
3     Phy
4     Eng
Name: dept, dtype: object

### 4. Create a new DataFrame by dropping the 2nd column data (indexed by 'floor') from the current DataFrame.

In [31]:
df_new = df.drop(columns=['floor'])
print(df_new)

   dept
0    CS
1   Bio
2  Chem
3   Phy
4   Eng

## Part 1 Task 2

Practice with a data file.

(1) Choose one data file from the data folder in the given TW1 folder.

(2) Read the data into a DataFrame.

(3) Access the rows and columns.

(4) Drop some columns.

### 1. Choose one data file from the data folder in the given TW1 folder.

#### Data file chosen: asthma.csv

### 2. Read the data into a DataFrame.

In [32]:
df = pd.read_csv('./data/asthma.csv')
df.head()

,ID,Date,Temp_Mean,Humi_Mean,PM25_Mean_R,CO2_Mean,PEFR_Morning,PEFR_After,PEFR_Max,Birth,Age,Gender,BMI,Income,Road_Distance,Cooking,Height
0,SB-011,11/1/17,23.477778,50.243056,47.041667,904.877778,280,300,300,3/23/53,66,1,21.34867,5,2,3,151.5
1,SB-011,11/2/17,23.401875,55.382639,40.629236,998.941667,270,300,300,3/23/53,66,1,21.34867,5,2,3,151.5
2,SB-011,11/3/17,23.446111,53.793056,43.817847,996.820833,280,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
3,SB-011,11/4/17,23.305417,49.570139,54.553681,1230.109722,280,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
4,SB-011,11/5/17,22.997708,46.295139,41.140208,1297.323611,280,310,310,3/23/53,66,1,21.34867,5,2,3,151.5

### 3. Access the rows and columns.

In [33]:
# Accessing first and second rows
df.iloc[0:2]

,ID,Date,Temp_Mean,Humi_Mean,PM25_Mean_R,CO2_Mean,PEFR_Morning,PEFR_After,PEFR_Max,Birth,Age,Gender,BMI,Income,Road_Distance,Cooking,Height
0,SB-011,11/1/17,23.477778,50.243056,47.041667,904.877778,280,300,300,3/23/53,66,1,21.34867,5,2,3,151.5
1,SB-011,11/2/17,23.401875,55.382639,40.629236,998.941667,270,300,300,3/23/53,66,1,21.34867,5,2,3,151.5

In [34]:
# Accessing CO2_Mean column
df['CO2_Mean']

0       904.877778
1       998.941667
2       996.820833
3      1230.109722
4      1297.323611
          ...
175    1199.881250
176    1320.761806
177    1162.570833
178    1147.852778
179    1339.854167
Name: CO2_Mean, Length: 180, dtype: float64

### 4. Drop some columns.

In [35]:
# Dropping PEFR_Morning and	PEFR_After columns
df_new = df.drop(columns=['PEFR_Morning', 'PEFR_After'])
df_new.head()

,ID,Date,Temp_Mean,Humi_Mean,PM25_Mean_R,CO2_Mean,PEFR_Max,Birth,Age,Gender,BMI,Income,Road_Distance,Cooking,Height
0,SB-011,11/1/17,23.477778,50.243056,47.041667,904.877778,300,3/23/53,66,1,21.34867,5,2,3,151.5
1,SB-011,11/2/17,23.401875,55.382639,40.629236,998.941667,300,3/23/53,66,1,21.34867,5,2,3,151.5
2,SB-011,11/3/17,23.446111,53.793056,43.817847,996.820833,310,3/23/53,66,1,21.34867,5,2,3,151.5
3,SB-011,11/4/17,23.305417,49.570139,54.553681,1230.109722,310,3/23/53,66,1,21.34867,5,2,3,151.5
4,SB-011,11/5/17,22.997708,46.295139,41.140208,1297.323611,310,3/23/53,66,1,21.34867,5,2,3,151.5